# Data Frame

In [5]:
import pandas as pd

# A DataFrame represents a rectangular table of data and contains an ordered 
collection of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index

Data frames= series + series

# Methods to create dataframes

# -Dictionary  into list

In [6]:
df1={
    "Names" : ["Sadiq shah" , "Ali Baksh" , "Faizaan" , "Kahisf"] ,
    "Degree": ["BScs" , "10th" , "BScs" , "Bscs"],
    "COntact No" : [22435346,6867978,67869898,769877]
    
    
}
data_frame=pd.DataFrame(df1)   # creating Dictionary into dataframe by using  "DataFrame" key word...
data_frame    # printing data frame

# ---> Keys of the dictionary are the columns values...and list will be value of the columns

        Names Degree  COntact No
0  Sadiq shah   BScs    22435346
1   Ali Baksh   10th     6867978
2     Faizaan   BScs    67869898
3      Kahisf   Bscs      769877

In [8]:
#Books Example....
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [14]:
# Book Example
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Dictionary into Dictionary

In [33]:
df3={ "State" : {"City" : "Karachi" ,"City" : "Lahore" ,  "City" : "Islamabad"},
      "Years" : {"Year" :2012,"Year" :2015,"Year" :2018},
     "Province": {"P" :"Sindh" , "P" :"Panjaab" ,"P" : "Panjaab"}
    
    
}
df3=pd.DataFrame(df3)
df3

          State   Years Province
City  Islamabad     NaN      NaN
P           NaN     NaN  Panjaab
Year        NaN  2018.0      NaN

In [34]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
data=pd.DataFrame(pop)
data

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

# dict of Series

In [39]:
d_o_s={
    "Country" : [pd.Series(["Pak" , "India" , "England" , "Australlia"])],
    "Capital" : [pd.Series(["Islamabad" , "Bombaai" , "Washingtine","NewYOrk"])]
    
    
    
}
data=pd.DataFrame(d_o_s)
data

,Country,Capital
0,0 Pak 1 India 2 Englan...,0 Islamabad 1 Bombaai 2 Washing...

# Dict into Tuples

In [41]:
d_o_s={
    "Country" :("Pak" , "India" , "England" , "Australlia"),
    "Capital" :("Islamabad" , "Bombaai" , "Washingtine","NewYOrk")
    
    
    
}
data=pd.DataFrame(d_o_s)
data

      Country      Capital
0         Pak    Islamabad
1       India      Bombaai
2     England  Washingtine
3  Australlia      NewYOrk

# List of list

In [7]:
data=[[2,3,4,5],[4,5,6,6]]   # Nested list(one list contain more  lists) [    [  ]   , [   ].....n  ]
datas=pd.DataFrame(data)
datas

   0  1  2  3
0  2  3  4  5
1  4  5  6  6